/*
    1. 숫자 (정수와 실수를 구분하지 않는다)
    2. 문자열 = 문자 집합
*/

// 1. 숫자 
// - 사칙연산 ( + - * / %)
// % (modula) = 나머지 연산자

// 2. 문자열 >> 
// 1) 쌍따옴표 "" 
// 2) 작은따옴표 '' 로 감싸주기
// 3) 문자열은 더하는 것이 가능합니다 >> 문자열 + 문자열
// 4) 다른 자료형(예를 들어서, 숫자 자료형)의 경우 문자열과 합치려면 형 변환(casting) 을 해준다.
/*
    "안녕하세요"
    'abcdefg'
*/


// 3. 이스케이프 문자
/*
    1) 수평 탭 = \t
    2) 행 바꿈 = \n
    3) 역슬래시 = \\
    4) 작은 따옴표 = \'
    5) 큰 따옴표 = \"
*/


// 4. bool 불 / boolean 불리언 >> 참과 거짓을 표현할 때 사용하는 자료
// True / False

// 5. 변수
var pi; // 선언하고
pi = 3.14195; // 할당하고
var pi = 3.14195; // 선언 + 할당

